app/views/professores/index.html.erb

<%= turbo_frame_tag "lista_professores", data: { turbo_action: "advance" } do %><section class="panel"><%= form_with url: professores_path, method: :get, class: "filters" do |f| %><div class="field filter-search"><%= f.label :busca, "Nome ou e-mail" %><%= f.search_field :busca, value: params[:busca], placeholder: "Buscar professor" %></div><div class="field"><%= f.label :ativo, "Situação" %><%= f.select :ativo, options_for_select([["Ativos", "true"], ["Inativos", "false"]], params[:ativo]), include_blank: "Todos" %></div><%= f.submit "Filtrar", class: "btn btn-primary" %><%= link_to "Limpar", professores_path, class: "btn btn-secondary" %><% end %>
<% if @professores.any? %><div class="professor-list"><% @professores.each do |professor| %><article class="professor-row"><span class="avatar"><%= iniciais(professor.nome) %></span><div class="professor-info"><%= link_to professor.nome, professor_path(professor), class: "appointment-name", data: { turbo_frame: "_top" } %><p><%= professor.email %></p></div><span class="badge <%= professor.ativo? ? 'badge-confirmada' : 'badge-cancelada' %>"><%= professor.ativo? ? "Ativo" : "Inativo" %></span><%= link_to "Ver cadastro →", professor_path(professor), class: "text-link", data: { turbo_frame: "_top" }, aria: { label: "Ver cadastro de #{professor.nome}" } %></article><% end %></div><% else %><%= render "shared/empty", title: "Nenhum professor encontrado", message: "Cadastre um professor ou ajuste os filtros de busca." %><% end %><%= render "shared/pagination" %></section><% end %>
---
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC