app/controllers/consultas_controller.rb

  def destroy
    authorize @consulta
    @consulta.destroy!
---
DELETE FROM "consultas" WHERE "consultas"."id" = $1  [["id", 4]]