app/controllers/dashboard_controller.rb

    scope = dashboard_scope
    @upcoming_consultas = scope.includes(:estagiario, :professor).upcoming.limit(6)
    @consultas_count = scope.count
    @confirmed_count = scope.confirmada.count
    @professores_count = Professor.active.count
---
SELECT COUNT(*) FROM "professors" WHERE "professors"."active" = $1  [["active", true]]