app/controllers/professores_controller.rb

  def create
    authorize Professor
    @professor = Professor.new(professor_params)
    if @professor.save
---
INSERT INTO "professors" ("name", "email", "crp", "specialty", "active", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"